In [1]:
# Import and create a SparkSession:

from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [3]:
location1 = [("Bob", 42, 'IT', 2000), 
           ("Lisa", 59,  'Finance', 3000), 
           ("Diane", 20,  'IT', 5000),
          ("Janet", 60,  'Finance', 7000)]

location2 = [("Calvin", 26, 'IT', 4000), 
           ("Elena", 24,  'Finance', 6000), 
           ("Bill", 50,  'IT', 1000),
          ("Dawn", 33,  'Finance', 8000)]

col = ['first_name', 'age', 'deptartment', 'salary']

location1df = spark.createDataFrame(data = location1,schema = col)

In [5]:
location1df.show()

+----------+---+-----------+------+
|first_name|age|deptartment|salary|
+----------+---+-----------+------+
|       Bob| 42|         IT|  2000|
|      Lisa| 59|    Finance|  3000|
|     Diane| 20|         IT|  5000|
|     Janet| 60|    Finance|  7000|
+----------+---+-----------+------+

In [6]:
location1df.printSchema()

root
 |-- first_name: string (nullable = true)
 |-- age: long (nullable = true)
 |-- deptartment: string (nullable = true)
 |-- salary: long (nullable = true)

In [7]:
location2df = spark.createDataFrame(data = location2,schema = col)

In [18]:
location2df.show()

+----------+---+-----------+------+
|first_name|age|deptartment|salary|
+----------+---+-----------+------+
|    Calvin| 26|         IT|  4000|
|     Elena| 24|    Finance|  6000|
|      Bill| 50|         IT|  1000|
|      Dawn| 33|    Finance|  8000|
+----------+---+-----------+------+

In [9]:
location2df.printSchema()

root
 |-- first_name: string (nullable = true)
 |-- age: long (nullable = true)
 |-- deptartment: string (nullable = true)
 |-- salary: long (nullable = true)

In [31]:
location = location1df.union(location2df)
location.show()

+----------+---+-----------+------+
|first_name|age|deptartment|salary|
+----------+---+-----------+------+
|       Bob| 42|         IT|  2000|
|      Lisa| 59|    Finance|  3000|
|     Diane| 20|         IT|  5000|
|     Janet| 60|    Finance|  7000|
|    Calvin| 26|         IT|  4000|
|     Elena| 24|    Finance|  6000|
|      Bill| 50|         IT|  1000|
|      Dawn| 33|    Finance|  8000|
+----------+---+-----------+------+

In [28]:
location3 = [("Ken", 66, 4500, 'IT'), 
           ("Lee", 21, 6500,'Finance'), 
           ("Asha", 53, 1500,'IT'),
          ("Marsh", 34, 8500,'Finance')]


col1 = ['first_name', 'age', 'salary','deptartment']

In [24]:
location3df = spark.createDataFrame(data = location3,schema = col1)

In [32]:
location3df.show()

+----------+---+------+-----------+
|first_name|age|salary|deptartment|
+----------+---+------+-----------+
|       Ken| 66|  4500|         IT|
|       Lee| 21|  6500|    Finance|
|      Asha| 53|  1500|         IT|
|     Marsh| 34|  8500|    Finance|
+----------+---+------+-----------+

In [33]:
location1 = location1df.union(location3df)
location1.show()

+----------+---+-----------+-------+
|first_name|age|deptartment| salary|
+----------+---+-----------+-------+
|       Bob| 42|         IT|   2000|
|      Lisa| 59|    Finance|   3000|
|     Diane| 20|         IT|   5000|
|     Janet| 60|    Finance|   7000|
|       Ken| 66|       4500|     IT|
|       Lee| 21|       6500|Finance|
|      Asha| 53|       1500|     IT|
|     Marsh| 34|       8500|Finance|
+----------+---+-----------+-------+

In [34]:
location2 = location1df.unionByName(location3df)
location2.show()

+----------+---+-----------+------+
|first_name|age|deptartment|salary|
+----------+---+-----------+------+
|       Bob| 42|         IT|  2000|
|      Lisa| 59|    Finance|  3000|
|     Diane| 20|         IT|  5000|
|     Janet| 60|    Finance|  7000|
|       Ken| 66|         IT|  4500|
|       Lee| 21|    Finance|  6500|
|      Asha| 53|         IT|  1500|
|     Marsh| 34|    Finance|  8500|
+----------+---+-----------+------+

In [38]:
location4 = [(1001,"Rich", 44, 4500, 'IT'), 
           (1002,"Raj", 33, 6500,'Finance'), 
           (1003,"Kevin", 55, 1500,'IT'),
          (1004,"Sam", 44, 8500,'Finance')]

col4 = ['Empid','first_name', 'age', 'salary','deptartment']

In [39]:
col4 = ['Empid','first_name', 'age', 'salary','deptartment']

In [40]:
location4df = spark.createDataFrame(data = location4,schema = col4)

In [41]:
location4df.show()

+-----+----------+---+------+-----------+
|Empid|first_name|age|salary|deptartment|
+-----+----------+---+------+-----------+
| 1001|      Rich| 44|  4500|         IT|
| 1002|       Raj| 33|  6500|    Finance|
| 1003|     Kevin| 55|  1500|         IT|
| 1004|       Sam| 44|  8500|    Finance|
+-----+----------+---+------+-----------+

In [42]:
from pyspark.sql.functions import lit

location2 = location1df.withColumn("Empid",lit(None))

In [43]:
location4df.unionByName(location2).show()

+-----+----------+---+------+-----------+
|Empid|first_name|age|salary|deptartment|
+-----+----------+---+------+-----------+
| 1001|      Rich| 44|  4500|         IT|
| 1002|       Raj| 33|  6500|    Finance|
| 1003|     Kevin| 55|  1500|         IT|
| 1004|       Sam| 44|  8500|    Finance|
| null|       Bob| 42|  2000|         IT|
| null|      Lisa| 59|  3000|    Finance|
| null|     Diane| 20|  5000|         IT|
| null|     Janet| 60|  7000|    Finance|
| null|       Ken| 66|  4500|         IT|
| null|       Lee| 21|  6500|    Finance|
| null|      Asha| 53|  1500|         IT|
| null|     Marsh| 34|  8500|    Finance|
+-----+----------+---+------+-----------+

In [45]:
location1df.unionByName(location4df, allowMissingColumns = True).show()

+----------+---+-----------+-------+-----+
|first_name|age|deptartment| salary|Empid|
+----------+---+-----------+-------+-----+
|       Bob| 42|         IT|   2000| null|
|      Lisa| 59|    Finance|   3000| null|
|     Diane| 20|         IT|   5000| null|
|     Janet| 60|    Finance|   7000| null|
|       Ken| 66|       4500|     IT| null|
|       Lee| 21|       6500|Finance| null|
|      Asha| 53|       1500|     IT| null|
|     Marsh| 34|       8500|Finance| null|
|      Rich| 44|         IT|   4500| 1001|
|       Raj| 33|    Finance|   6500| 1002|
|     Kevin| 55|         IT|   1500| 1003|
|       Sam| 44|    Finance|   8500| 1004|
+----------+---+-----------+-------+-----+